## Plan Result (main)

[CI link](https://github.com/Shion1305/Shion1305-infra/actions/runs/16556675902)



<pre><code>Plan: 9 to add, 4 to change, 0 to destroy.</code></pre>

* Create
  * oci_core_network_security_group.k8s-nsg
  * oci_core_network_security_group.main-nsg
  * oci_core_network_security_group_security_rule.k8s-nsg-egress-rule
  * oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule
  * oci_core_network_security_group_security_rule.main-nsg-egress-rule
  * oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere
  * oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn
  * oci_core_network_security_group_security_rule.main-nsg-ingress-ssh
  * oci_core_security_list.permissive-security-list
* Update
  * oci_core_instance.instance-2022
  * oci_core_security_list.main-security-list
  * oci_core_subnet.main-subnet
  * module.oci_compute_instance-k8s.oci_core_instance.this



<details><summary>Change Result (Click me)</summary>

```hcl

  # oci_core_instance.instance-2022 will be updated in-place
  ~ resource "oci_core_instance" "instance-2022" {
        id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycklw5l5plncwm7nj64rdqpga6zfe67gsn2zzouexqnlwa"
        # (24 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ nsg_ids                   = [] -> (known after apply)
            # (12 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # oci_core_network_security_group.k8s-nsg will be created
  + resource "oci_core_network_security_group" "k8s-nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "K8s Network Security Group - No Restrictions"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"
    }

  # oci_core_network_security_group.main-nsg will be created
  + resource "oci_core_network_security_group" "main-nsg" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "Main Network Security Group"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"
    }

  # oci_core_network_security_group_security_rule.k8s-nsg-egress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "k8s-nsg-egress-rule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.k8s-nsg-ingress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "k8s-nsg-ingress-rule" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.main-nsg-egress-rule will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-egress-rule" {
      + description               = (known after apply)
      + destination               = "0.0.0.0/0"
      + destination_type          = "CIDR_BLOCK"
      + direction                 = "EGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "all"
      + source_type               = (known after apply)
      + stateless                 = (known after apply)
      + time_created              = (known after apply)
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-anywhere will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-icmp-anywhere" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "1"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + icmp_options {
          + code = 4
          + type = 3
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-icmp-vcn will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-icmp-vcn" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "1"
      + source                    = "10.0.0.0/16"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + icmp_options {
          + code = -1
          + type = 3
        }
    }

  # oci_core_network_security_group_security_rule.main-nsg-ingress-ssh will be created
  + resource "oci_core_network_security_group_security_rule" "main-nsg-ingress-ssh" {
      + description               = (known after apply)
      + destination               = (known after apply)
      + destination_type          = (known after apply)
      + direction                 = "INGRESS"
      + id                        = (known after apply)
      + is_valid                  = (known after apply)
      + network_security_group_id = (known after apply)
      + protocol                  = "6"
      + source                    = "0.0.0.0/0"
      + source_type               = "CIDR_BLOCK"
      + stateless                 = (known after apply)
      + time_created              = (known after apply)

      + tcp_options {
          + destination_port_range {
              + max = 22
              + min = 22
            }
        }
    }

  # oci_core_security_list.main-security-list will be updated in-place
  ~ resource "oci_core_security_list" "main-security-list" {
        id             = "ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa"
        # (7 unchanged attributes hidden)

      - ingress_security_rules {
          - protocol    = "1" -> null
          - source      = "10.0.0.0/16" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - icmp_options {
              - code = -1 -> null
              - type = 3 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "1" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - icmp_options {
              - code = 4 -> null
              - type = 3 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 22 -> null
              - min = 22 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 443 -> null
              - min = 443 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 80 -> null
              - min = 80 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = true -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 4914 -> null
              - min = 4914 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "6" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = true -> null
            # (1 unchanged attribute hidden)

          - tcp_options {
              - max = 6443 -> null
              - min = 6443 -> null
            }
        }
      - ingress_security_rules {
          - protocol    = "all" -> null
          - source      = "0.0.0.0/0" -> null
          - source_type = "CIDR_BLOCK" -> null
          - stateless   = false -> null
            # (1 unchanged attribute hidden)
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "10.0.0.0/16"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = -1
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "1"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + icmp_options {
              + code = 4
              + type = 3
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 22
              + min = 22
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 443
              + min = 443
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false

          + tcp_options {
              + max = 80
              + min = 80
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = true

          + tcp_options {
              + max = 4914
              + min = 4914
            }
        }
      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "6"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = true

          + tcp_options {
              + max = 6443
              + min = 6443
            }
        }

        # (1 unchanged block hidden)
    }

  # oci_core_security_list.permissive-security-list will be created
  + resource "oci_core_security_list" "permissive-security-list" {
      + compartment_id = "ocid1.tenancy.oc1..aaaaaaaa57p4zuoumu3dkeasy3zuom3ouhmxwdk3eo3frkdmvtkpc4nvkqdq"
      + defined_tags   = (known after apply)
      + display_name   = "Security List - Allow All"
      + freeform_tags  = (known after apply)
      + id             = (known after apply)
      + state          = (known after apply)
      + time_created   = (known after apply)
      + vcn_id         = "ocid1.vcn.oc1.ap-tokyo-1.amaaaaaaqiqkkcyavaoppezgphkllmrizfar3ycecg7phwvws4ceipafbdra"

      + egress_security_rules {
          + description      = (known after apply)
          + destination      = "0.0.0.0/0"
          + destination_type = "CIDR_BLOCK"
          + protocol         = "all"
          + stateless        = false
        }

      + ingress_security_rules {
          + description = (known after apply)
          + protocol    = "all"
          + source      = "0.0.0.0/0"
          + source_type = "CIDR_BLOCK"
          + stateless   = false
        }
    }

  # oci_core_subnet.main-subnet will be updated in-place
  ~ resource "oci_core_subnet" "main-subnet" {
        id                         = "ocid1.subnet.oc1.ap-tokyo-1.aaaaaaaaneghxjqpturxbnptzpcf44egzgd2gzg3el2oxyum2lj3ygczbkeq"
      ~ security_list_ids          = [
          - "ocid1.securitylist.oc1.ap-tokyo-1.aaaaaaaa55cshiuxh35trjx2r5bmm2jfnqevn4f4s56kt54bu2q27nxal4sa",
        ] -> (known after apply)
        # (17 unchanged attributes hidden)
    }

  # module.oci_compute_instance-k8s.oci_core_instance.this will be updated in-place
  ~ resource "oci_core_instance" "this" {
        id                          = "ocid1.instance.oc1.ap-tokyo-1.anxhiljrqiqkkcycqrbpmpg5ljs6qo33hcfmcll3kbdoukpdbhtoeify2syq"
        # (25 unchanged attributes hidden)

      ~ create_vnic_details {
          ~ nsg_ids                   = [] -> (known after apply)
            # (12 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

Plan: 9 to add, 4 to change, 0 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"run-terragrunt-plan","PRNumber":46,"Program":"tfcmt","SHA1":"4bab0b6982e38e3d0ae232f56e3e3ec1865e3b63","Target":"main","Vars":{},"WorkflowName":"Run Plan on OCI"} -->